[
[6,"Accept","Welche Inhaltstypen der Client verarbeiten kann. Ist es dem Server nicht möglich, einen Inhaltstyp bereitzustellen, der vom Client akzeptiert wird, kann er entweder den HTTP-Statuscode `[406 Not acceptable](https://de.wikipedia.org/wiki/HTTP-Statuscode#4xx_%E2%80%93_Client-Fehler \"HTTP-Statuscode\")` senden oder einen beliebigen Inhaltstyp zum Kodieren der angeforderten Informationen verwenden.[\\[10\\]](https://de.wikipedia.org/wiki/Liste_der_HTTP-Headerfelder#cite_note-10) Fehlt das Accept-Feld, so bedeutet dies, dass der Client alle Inhaltstypen akzeptiert. Kann der Server in diesem Beispiel den Inhalt der angeforderten Ressource sowohl als HTML als auch als Bild im GIF-Format an den Client senden, führt der Accept-Header der Anfrage dazu, dass als Inhaltstyp der Antwort HTML gewählt wird."],
[6,"Accept-Charset","Welche [Zeichensätze](https://de.wikipedia.org/wiki/Zeichensatz \"Zeichensatz\") der Client anzeigen kann und somit empfangen möchte. Die passende Datei wird über Content Negotiation (z. B. bei Apache mod\\_negotiation) herausgesucht."],
[6,"Accept-Encoding","Welche komprimierten Formate der Client unterstützt. Über Content Negotiation wird eine passend komprimierte Datei ausgeliefert."],
[6,"Accept-Language","Welche Sprachen der Client akzeptiert. Falls der Server passend eingerichtet ist und die Sprachversionen vorhanden sind, wird über Content Negotiation die passende Datei ausgeliefert."],
[6,"Authorization","Authentifizierungsdaten für [HTTP-Authentifizierungsverfahren](https://de.wikipedia.org/wiki/HTTP-Authentifizierung#Basic_Authentication \"HTTP-Authentifizierung\")"],
[6,"Cache-Control","Wird genutzt, um Optionen festzulegen, denen durch alle Caching-Mechanismen entlang der Anfrage-/Antwort-Kette Folge geleistet werden muss."],
[6,"Connection","Welchen Typ von Verbindung der Client bevorzugt."],
[6,"Cookie","ein HTTP-Cookie, das zuvor vom Server mit `Set-Cookie` gesetzt wurde"],
[6,"Content-Length","Länge des Bodys in [Bytes](https://de.wikipedia.org/wiki/Byte \"Byte\")"],
[6,"Content-MD5","Eine [Base64](https://de.wikipedia.org/wiki/Base64 \"Base64\")\\-codierte [MD5](https://de.wikipedia.org/wiki/MD5 \"MD5\")\\-Checksumme des Bodys"],
[6,"Content-Type","[MIME-Typ](https://de.wikipedia.org/wiki/Internet_Media_Type \"Internet Media Type\") des Bodys (hier genutzt für POST- und PUT-Operationen)"],
[6,"Date","[Datum](https://de.wikipedia.org/wiki/Kalenderdatum \"Kalenderdatum\") und Zeit zum Sendezeitpunkt der Anfrage"],
[6,"Expect","Zeigt, welches Verhalten der Client vom Server erwartet. Falls der Server diesen Header nicht versteht oder das Verhalten nicht erfüllen kann, muss er den Code `417 Expectation Failed` senden. Der Client sendet ein `Expect: 100-continue`, wenn er nur den Header, aber nicht den Body einer (sehr großen) Anfrage sendet und daraufhin den [HTTP-Statuscode](https://de.wikipedia.org/wiki/HTTP-Statuscode \"HTTP-Statuscode\") `100 Continue` als Bestätigung erwartet, um eine evtl. sehr große Anfrage schicken zu können. Zweck ist hierbei sicherzugehen, dass der Server die (sehr große) Anfrage annehmen wird."],
[6,"Forwarded","Dient der Identifizierung des weiterleitenden Reverse-Proxies (Lastverteilers), des ursprünglich anfragenden Clients, des ursprünglich genutzten Protokolls sowie des ursprünglich angefragten Hosts und Ports, da ein Reverse-Proxy (Lastverteiler) diese Informationen funktionsbedingt verändert."],
[6,"From","E-Mail-Adresse des Nutzers, der die Anfrage stellte (heute unüblich). RFC 2616[\\[1\\]](https://de.wikipedia.org/wiki/Liste_der_HTTP-Headerfelder#cite_note-RFC2616-1) sagt hierzu, dass der `From:` _nicht_ ohne ausdrückliche Genehmigung des Nutzers gesendet werden darf."],
[6,"Host","Domain-Name des Servers, zwingend vorgeschrieben seit HTTP/1.1 und nötig für [namensbasierte Hosts](https://de.wikipedia.org/wiki/Virtual_Hosting \"Virtual Hosting\"). Bei Fehlen dieses Headers muss der Server nach Definition mit `400 Bad Request` antworten."],
[6,"If-Match","Aktion nur durchführen, falls der gesendete Code mit dem auf dem Server vorhandenen Code übereinstimmt."],
[6,"If-Modified-Since","Erlaubt dem Server, den Statuscode `304 Not Modified` zu senden, falls sich seit dem angegebenen Zeitpunkt nichts verändert hat."],
[6,"If-None-Match","Erlaubt dem Server bei unverändertem Inhalt (verifiziert durch ETags) den Statuscode `304 Not Modified` als Antwort, siehe [HTTP ETag](https://de.wikipedia.org/wiki/HTTP_ETag \"HTTP ETag\")"],
[6,"If-Range","Falls der Client einen Teil einer Datei vom Server im Cache liegen hat, die sich auf dem Server nicht verändert hat, nur den fehlenden Rest senden; ansonsten ganze Datei schicken."],
[6,"If-Unmodified-Since","Nur dann die Seite senden, falls diese seit dem angegebenen Zeitpunkt nicht geändert wurde. Wurde die Seite geändert, so sendet der Server den Statuscode `412 Precondition Failed`, bei unveränderter Seite unterscheidet sich die Antwort nicht von einer normalen Antwort und der Client erhält einen 2xx-Statuscode (`Success`)."],
[6,"Max-Forwards","Begrenzt die Anzahl der möglichen Weiterleitungen durch [Proxys](https://de.wikipedia.org/wiki/Proxy_(Rechnernetz) \"Proxy (Rechnernetz)\") oder Gateways. Das Feld enthält die verbleibende Anzahl an Weiterleitungen, somit muss jeder Proxy diese Zahl aktualisieren (dekrementieren)"],
[6,"Pragma","Das Feld Pragma enthält Optionen, die möglicherweise nur von einigen Implementationen verstanden werden und sich an alle Glieder in der Frage-Antwort-Kette richten."],
[6,"Proxy-Authorization","Im Feld `Proxy-Authorization` können Autorisierungsdaten für Proxys mit Autorisierungszwang eingebettet werden."],
[6,"Range","Enthält eine Bereichsangabe für den Bereich, den der Client vom Server anfordert (in diesem Beispiel nur die Bytes 500-999)"],
[6,"Referer","Im Feld Referer ist der [URI](https://de.wikipedia.org/wiki/Uniform_Resource_Identifier \"Uniform Resource Identifier\") der verweisenden Seite enthalten. Klickt man also auf der Hauptseite der deutschsprachigen Wikipedia einen Link an, so sendet der Browser dem Server der aufgerufenen Seite ein Headerfeld wie im Beispiel. (Das Wort „Referer“ ist, sowohl im RFC als auch in den meisten Implementationen, falsch geschrieben; richtig wäre „Referrer“ (von _to refer, referred, referred_))"],
[6,"TE","Welche Formate der Client annehmen kann, möglich sind hier z. B. [gzip](https://de.wikipedia.org/wiki/Gzip \"Gzip\") oder [deflate](https://de.wikipedia.org/wiki/Deflate \"Deflate\"). „trailers“ gibt hier an, dass der Client das Feld „Trailer“ in den einzelnen Stücken beim Encoding-Modus „Chunked“ akzeptiert und auswertet. (Siehe hierzu Kapitel 3.6, 3.6.1, 14.39, 14.40 in RFC 2616[\\[1\\]](https://de.wikipedia.org/wiki/Liste_der_HTTP-Headerfelder#cite_note-RFC2616-1))"],
[6,"Transfer-Encoding","Die Transformationen, die angewendet wurden, um den Inhalt sicher zum Server zu transportieren. Zurzeit sind folgende Methoden[\\[14\\]](https://de.wikipedia.org/wiki/Liste_der_HTTP-Headerfelder#cite_note-http-parameters-14) definiert: chunked (aufgeteilt), [compress](https://de.wikipedia.org/wiki/Compress \"Compress\") (komprimiert), [deflate](https://de.wikipedia.org/wiki/Deflate \"Deflate\") (komprimiert), [gzip](https://de.wikipedia.org/wiki/Gzip \"Gzip\") (komprimiert), identity."],
[6,"Upgrade","Vorschlag an den Server, ein anderes Protokoll zu nutzen"],
[6,"User-Agent","Der [User-Agent-String](https://de.wikipedia.org/wiki/User_Agent \"User Agent\") des Clients. In ihm stehen Informationen über den Client, sodass z. B. ein serverseitiges Skript an verschiedene Browser angepasste Inhalte ausliefern kann (z. B. bei Downloadseiten, bei denen für [Mac OS](https://de.wikipedia.org/wiki/Mac_OS_(Apple) \"Mac OS (Apple)\") andere Links angeboten werden sollen als für [Windows](https://de.wikipedia.org/wiki/Microsoft_Windows \"Microsoft Windows\"))"],
[6,"Via","Gibt dem Server Informationen über Proxys im Übertragungsweg."],
[6,"Warning","Allgemeine Warnungen über den Umgang mit dem Body oder den Body selbst."]
]